Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/enforcement_and_redress/rights_commissioner.html.txt.tmx
Source language: en
Languages: ga

source: Adjudication of employment rights disputes and complaints
ga: Breithniúchán na ndíospóidí agus na ngearán faoi chearta fostaíochta

source: Under the Workplace Relations Act 2015, the adjudication service (formerly the Rights Commissioner Service) now operates as part of the Workplace Relations Commission
ga: Is faoin Acht um Chaidreamh sa Láthair Oibre 2015, a fheidhmíonn an tseirbhís breithniúcháin (ar ar tugadh Seirbhís an Choimisinéara um Chearta roimhe seo) anois mar chuid den Choimisiún um Chaidreamh Oibreachais

source: Adjudication officers are independent in the performance of their duties
ga: Is neamhspleách iad na hoifigigh is breithneoirí i gcleachtadh a ndualgas

source: They investigate disputes, grievances and claims that individuals or small groups of workers make under employment legislation including redundancy, unfair dismissal, minimum notice, minimum wage, hours of work and leave
ga: Fiosraíonn siad díospóidí, casaoidí agus éilimh a thugann daoine aonair nó grúpaí oibrithe beaga faoi reachtaíocht na fostaíochta lena n-áirítear iomarcaíocht, dífhostú éagórach, fógra íosta, pá íosta, uaireanta oibre agus saoire

source: The list of legislation under which complaints may be referred for adjudication is in Schedule 5 of the Workplace Relations Act 2015
ga: Faightear an liosta reachtaíochta dár bhféidir gearáin a tharchur i gcomhair breithniúcháin i Sceideal 5 den Acht um Chaidreamh san Áit Oibre 2015

source: A complaint to the Workplace Relations Commission (see 'How to apply' below) may be made by the person directly affected, that is, the direct complainant or, in some cases, by a specified person acting on behalf of the direct complainant
ga: An duine a ndeachthas i bhfeidhm orthu go díreach, is é sin le rá, an gearánaí díreach, nó i gcásanna áirithe an duine sonraithe atá ag feidhmiú ar son an ghearánaí dhírigh; is féidir leo gearán a thabhairt don Choimisiún um Chaidreamh Oibreachais (féach ‘Conas iarratas a dhéanamh’ thíos)

source: A specified person is a person who is named in the relevant employment law as being entitled to present a complaint or refer a dispute
ga: Is ionann duine sonraithe agus duine a ainmnítear sa dlí fostaíochta ábhartha de bheith i dteideal gearán a chur i láthair nó díospóid a tharchur

source: Before an employee makes a complaint they should inform their employer that they intend to contact the Workplace Relations Commission (WRC)
ga: Ba cheart d’fhostaí a chur in iúl dá bhfostóir go bhfuil sé ar intinn acu teagmháil a dhéanamh leis An Coimisiún um Chaidreamh Oibreachais (WRC) sula ndéanann siad gearán

source: Where the complaint is about a statutory entitlement they should try and resolve the matter locally before applying to the WRC
ga: Ba cheart dóibh iarracht a dhéanamh an t-ábhar a réiteach go háitiúil sula ndéantar iarratas don WRC sa chás go mbaineann an gearán le teidlíocht reachtúil éigin

source: A complaint is made to the Director General of the WRC initially
ga: Is chuig Ard-Stiúrthóir an WRC ar dtús a dhéantar gearán

source: The Director General may refer it to a mediation officer if it is considered that the complaint can be resolved without being referred to an adjudicator and if neither party objects to it being dealt with through mediation
ga: Is féidir leis an Ard-Stiúrthóir é a tharchur chuig oifigeach idirghabhála má mheastar gur féidir an gearán a fhuascailt gan tarchur chuig breithneoir agus mura ndéanann neachtar den dá pháirtí agóid dá phlé trí mheán an idirghabhála

source: If the complaint is not dealt with through mediation or if the mediation is not successful, it is referred to an adjudication officer
ga: Tarchuirtear an gearán chuig oifigeach breithniúcháin mura bpléitear leis trí mheán an idirghabhála ná mura n-éiríonn leis an idirghabháil

source: The adjudication officer generally conducts an inquiry
ga: Is iondúil go ndéanann an t-oifigeach breithniúcháin fiosrúchán

source: The Director General may decide to deal with the complaint by written submissions only, unless either party objects within 42 days of being informed
ga: Is féidir leis an Ard-Stiúrthóir cinneadh a ghlacadh chun plé leis an ngearán trí aighneachtaí scríofa amháin, mura ndéanann neachtar den dá pháirtí agóide laistigh de 42 lá óna gcur ar an eolas

source: More information about the procedures in the investigation of employment and equality complaints (pdf) is available on workplacerelations.ie
ga: Tá tuilleadh faisnéise faoi nósanna imeachta san imscrúdú gearáin fostaíochta agus comhionannais (pdf) ar workplacerelations.ie

source: At the inquiry both parties have an opportunity to be heard and present any relevant evidence
ga: Bíonn an deis ag an dá pháirtí ag an bhfiosrúchán le héisteacht a fháil agus chun aon fhianaise ábhartha a chur i láthair

source: The hearings are held in private
ga: Is go príobháideach a reáchtáiltear na héisteachtaí

source: The person who is making the complaint may be accompanied and represented at the hearing by:
ga: An duine atá ag déanamh an ghearáin; is féidir leis na dreamanna seo a leanas bheith mar thionlacan nó ionadaí ag an éisteach dóibh:

source: • A trade union official or an official of a body which represents the interests of employers
ga: • Oifigeach ó cheardchumann nó oifigeach ó chomhlacht a fheidhmíonn do leasanna fostóirí

source: • A practising barrister or practising solicitor
ga: • Abhcóide nó aturna atá i mbun a gceirde

source: • In the case of a complainant who is aged under 18 a parent or guardian (as well as one of the people already listed)
ga: • Tuismitheoir nó caomhnóir (chomh maith le duine amháin de na daoine a liostaíodh cheana féin) i gcás gearánaí faoi bhun 18 bliain d’aois

source: • Any other person with the permission of the adjudication officer
ga: • Aon duine eile le cead ón oifigeach breithniúcháin

source: The adjudication officer makes a decision in accordance with the relevant law and the decision is given to the parties in writing
ga: Is é an t-oifigeach breithniúcháin a ghlacann cinneadh i gcomhréir leis an dlí ábhartha agus tugtar an cinneadh sin i scríbhinn do na páirtithe

source: At this stage, either party may appeal this decision – see below
ga: Is féidir le ceachtar den dá pháirtí an cinneadh sin a achomharc ag an gcéim seo - féach thíos

source: Decisions by adjudication officers will be published on the internet without identifying the parties
ga: Foilseofar cinntí na n-oifigeach breithniúcháin ar an idirlíon gan na páirtithe a shainaithint

source: Enforcement of the adjudication officer’s decision
ga: Forghníomhú chinneadh an oifigigh bhreithniúcháin

source: The employer has 56 days in which to carry out the decision of the adjudication officer
ga: Beidh 56 lá ag an bhfostóir chun cinneadh an oifigigh bhreithniúcháin a chur i bhfeidhm

source: If the employer fails to do so, the employee, the WRC, the employee’s trade union or excepted body (an excepted body is a body that represents the interests of a particular group of workers) may apply to the District Court for an order directing the employer to do so
ga: Má mhainníonn an fostóir chuige sin, is féidir leis an bhfostaí leis an WRC, le ceardchumann nó comhlacht eiscthe an fhostaí (is ionann comhlacht eiscthe agus comhlacht a fheidhmíonn mar ionadaí do leasanna grúpa oibrithe faoi leith) iarratas a dhéanamh don Chúirt Dúiche i gcomhair ordú ag treorú an fhostóra chuige sin

source: In general, the District Court must make the order
ga: Is iondúil gurb í an Chúirt Dúiche a chaitheann an t-ordú a dhéanamh

source: If the decision was to reinstate or re-engage the employee, the District Court may substitute an order to pay compensation of up to 104 weeks’ pay calculated in accordance with the rules under the Unfair Dismissals Acts 1977–2007
ga: Dá mba rud é gurbh ionann an cinneadh chun an fostaí a chur ar ais ina bpost nó a athfhostú, is féidir leis an gCúirt Dúiche ordú a chur ina ionad chun cúiteamh suas le pá 104 seachtain a íoc i gcomhréir leis na rialacha faoin na hAchtanna um Dhífhostú Éagórach 1977-2007

source: In all cases involving compensation, the District Court may also order interest to be paid
ga: Is féidir leis an gCúirt Dúiche ordú a thabhairt freisin go n-íocfar ús i ngach aon chás lena mbaineann an cúiteamh

source: It is an offence to fail to comply with an order directing an employer to pay such compensation to an employee unless the employer can show, on the balance of probabilities that they were unable to comply with the order due to financial circumstances
ga: Is cion é chun mainneachtain chun comhlíonadh le hordú ag treorú d’fhostóir chun cúiteamh mar sin a íoc le fostaí éigin mura féidir leis an bhfostóir léiriú, ar chothromaíocht na ndóchúlachtaí nárbh fhéidir leo comhlíonadh leis an ordú de bharr cúinsí airgeadais

source: Appealing an adjudicator’s decision to the Labour Court
ga: Cinneadh breithneora a achomharc chun na Cúirte Oibreachais

source: A decision of an adjudicator may be appealed to the Labour Court within 42 days
ga: Is féidir cinneadh breithneora a achomharc chun na Cúirte Oibreachais laistigh de 42 lá

source: This time limit can be extended if the Labour Court is satisfied that there were exceptional circumstances causing the delay
ga: Is féidir síneadh a chur leis an teorainn ama sin má tá an Chúirt Oibreachais sásta gurbh ann do chúinsí eisceachtúil ba chúis leis an moill

source: A complaint to the Workplace Relations Commission must be presented within 6 months of the date of the alleged breach of the Act
ga: Caithfear gearán chuig an Coimisiún um Chaidreamh Oibreachais a thabhairt laistigh de 6 mhí ó dháta an tsáraithe líomhnaithe den Acht

source: The time limit for submitting a complaint may be extended by a further 6 months if there was "reasonable cause for the delay"
ga: Is féidir síneadh a chur leis an teorainn ama do thaisceadh gearáin faoi 6 mhí breise má bhain cúis réasúnta leis an moill

source: The online complaint form is available on workplacerelations.ie
ga: Tá an fhoirm gearáin ar líne ar fáil ar workplacerelations.ie

source: For further information on your employment rights contact the Workplace Relations Commission's Information and Customer Services - see 'Where to apply' below. Where to apply
ga: I gcomhair a thuilleadh faisnéise faoi do chearta fostaíochta déan teagmháil leis an tSeirbhíse Faisnéise agus Custaiméara an Choimisiúin um Chaidreamh Oibreachais - féach ‘Cá háit a ndéanfaidh mé iarratas' thíos

source: Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland
ga: Cá háit a ndéanfaidh mé iarratas?
